[PAD]
[CLS]
[MASK]
[SEP]
21088
13292
363
4409
15877
1356
6600
18241
15367
14595
4385
14484
18435
17593
15490
16854
1651
20734
8952
20956
3236
16837
15204
15418
10227
9632
10997
964
503
4730
8627
9128
17497
2110
6632
17500
226
17278
15488
18329
5956
4510
11192
13121
15201
19150
5254
1674
4527
5272
13221
6175
16501
16285
14824
6078
1580
16787
4484
366
6110
792
3737
15189
14210
5463
3998
1437
10939
307
1776
11522
7974
13070
9425
16594
18272
15759
709
11953
19474
17216
10279
11746
17235
9328
15896
7965
20945
19615
7004
1934
17856
1361
14300
17831
3092
11044
19964
2421
2968
10683
18077
8523
19576
13994
2226
4016
15666
11938
4581
21117
2035
13154
6424
5538
15460
9100
5664
5340
21125
20788
7146
7530
10466
5803
21079
14501
2914
2701
12057
11266
2298
18736
5625
1464
722
9238
14035
17920
17001
1992
21223
9359
5688
17329
2523
13132
3565
3770
40
1936
5647
21176
7524
7142
12047
12496
9935
16435
5815
21060
5458
19399
12483
16571
10935
4830
20044
10680
16314
2561
18773
6367
2938
19428
13173
20192
16163
11959
1405
2283
14116
7314
1338
3193
18104
16932
17352
12305
7838
3557
15863
9086
5839
19686
3864
13962
7293
18646
8075
8635
1788
13981
15269
8623
6611
15346
2236
16340
8100
17774
4559
14784
13870
10068
10811
20533
3934
15185
7154
9292
2323
19696
573
2073
1615
11376
16117
5764
17299
10652
1274
20111
12437
3957
17985
12214
15481
7605
691
2034
19880
19796
3968
7830
19437
5285
12445
1202
16069
4868
3350
10794
356
11005
302
13380
17804
1171
3846
13385
8824
11779
17145
12137
20122
19026
3074
15585
13782
11816
15395
3638
16118
13765
16618
3826
8716
1332
5071
15019
1303
20462
9469
19243
10887
8355
4987
4469
6359
1923
5978
11426
19149
6758
3322
19831
12013
2490
15444
7895
9125
18909
16803
10507
5999
13438
10609
14376
10106
14619
5657
17291
18070
7465
2821
11603
3179
587
19330
16066
5732
16875
20985
1695
14336
5440
4665
10539
12999
7220
1845
20088
715
3304
13327
12130
7180
8599
15407
15070
5817
6911
4326
16373
15224
14004
2152
5280
16224
16703
10410
19365
18159
5671
3562
16975
9760
5899
3965
13150
3614
19479
12375
5169
12311
9213
443
17925
20847
4504
367
2777
17757
5073
2667
11054
17429
20511
5570
10458
12048
9215
7594
4989
8656
4458
3089
20402
2272
9688
10845
8667
16271
3385
12853
6189
7081
6464
16093
3661
13849
9374
9030
1542
1765
18132
18547
1979
5074
20971
7501
417
5156
1060
6154
8692
6099
18630
10809
15917
14002
16817
7555
19269
159
14639
7736
20913
686
9829
21045
13365
5036
9738
10007
13606
13958
3561
4687
7878
10921
16922
1320
467
17066
19093
14985
16760
5182
17643
10982
3743
320
18857
1358
7420
19180
18061
15190
243
15074
9228
9387
2207
20164
13818
6481
16377
9722
3775
11664
3662
8369
5230
1935
20573
19695
11561
18400
5497
7568
718
3627
7145
1150
12801
8485
7053
2677
1607
12024
7409
12833
20181
3347
2004
1888
12378
17722
10494
18896
6653
17402
16411
19830
11084
16957
3570
3480
9203
7946
2205
3653
15312
9929
13629
17166
17192
1414
13333
9163
11013
14024
2024
17822
19048
6969
11784
3831
19327
6524
14299
2759
6086
1807
15722
18039
3251
17809
3332
19325
4785
7976
16951
17084
10587
16184
7911
18963
5238
17370
7739
121
8214
19309
6978
17589
11893
11359
11962
13116
8505
13643
11734
8377
3154
7113
12682
13016
428
6961
5615
16279
1018
5218
963
7776
9298
393
736
17855
7633
18530
1296
16756
12100
9199
18883
16528
7998
4307
2783
15814
19219
3709
7201
7210
11728
12424
7665
16239
18723
20256
6128
19136
14330
3916
19645
12032
1980
4049
16680
2209
18739
7342
16595
10832
8030
8208
10705
3389
13280
9189
286
1282
19771
1558
15499
18449
13672
5633
5248
18254
8139
3645
14218
18757
18809
6625
155
8536
5715
13329
7300
12695
3033
9187
8589
20770
1344
5104
8341
18193
1518
18168
13487
5300
10127
19773
17578
6373
20820
12329
5429
13137
2607
16805
19962
13104
3500
6960
931
19147
20593
4688
2488
17488
787
19879
20470
2200
5457
4136
17762
10183
4650
7027
16614
12983
7550
4536
3441
8245
9966
20964
17840
6605
2219
17600
6259
8349
6532
4678
11144
3656
20168
10084
5145
2069
19981
17111
8972
6816
11646
13594
4939
12812
9551
5590
4150
8159
14432
19216
11055
11276
14089
19294
13741
1689
21019
10367
16612
20184
4015
15634
7322
19296
17814
1522
13913
14416
11356
15287
11600
1954
971
9413
18698
14814
16631
1114
20273
355
1081
9937
2741
7121
3752
18738
10876
13025
18445
7478
13963
7206
6005
7891
2451
18125
3437
16045
16307
17440
4713
3072
16644
6821
3536
20014
13851
8906
1652
4790
19571
15088
1513
3756
4492
8881
1564
7909
916
11101
968
12559
18904
6717
1486
11454
16524
55
17555
16765
3877
536
5915
18443
11425
10508
13198
18539
14467
8752
21077
3021
14464
3972
11468
10392
9619
559
3148
18194
1012
15352
3276
1908
17088
5055
1561
18568
6122
16109
10493
8053
15919
16210
16812
16745
2074
9741
331
13151
20633
9660
4404
7023
10557
16449
2988
19613
16450
5745
12072
18350
19347
1540
19182
11410
20207
15092
10849
4172
14446
15701
12061
13906
18054
20750
11520
7558
4594
6776
21187
14911
10865
2078
20517
318
14519
12335
11702
18431
13141
17499
19980
11330
10280
18059
532
14399
1289
17317
20309
15428
13350
11588
12588
20353
15926
1381
357
17821
4233
3553
6657
5464
1884
20495
770
2622
8109
5766
9949
13337
8801
7786
10461
5620
311
18711
16341
9613
19405
9281
19223
4975
13660
65
10803
14
17405
6668
18345
1588
3115
7292
6976
6064
2467
3746
20106
4446
18398
17237
11692
2258
744
12597
10706
2220
13788
1497
8641
9679
19234
13832
18119
11274
10283
4327
4441
7741
7271
8541
17319
10296
11392
7009
8188
19721
9792
15628
17620
8048
12729
11980
7927
8292
1863
5840
2379
6111
1890
10919
16336
19375
13877
342
10864
835
5562
4341
16726
14815
3870
8206
6244
8181
1093
61
11444
5088
20067
20624
10302
15434
4674
12337
8194
18800
3269
17980
15675
6058
19589
13623
9987
84
0
16156
6400
18550
11399
1909
7688
19351
2825
20465
7986
12193
9921
16342
4067
11344
14551
13129
5186
17685
2595
771
74
20662
4442
11438
12937
10419
19450
7753
8781
7315
2730
19116
6533
7423
16445
4922
4078
3835
11726
6166
4690
1850
5009
3120
5759
20195
4782
4724
11557
21169
4332
3515
14524
17999
19872
3897
8975
5524
17773
990
16519
9352
20282
8808
19684
9055
4040
15692
17071
9368
1285
20846
9772
695
11095
6425
15067
10715
5424
19292
1728
1889
5868
14563
21224
9293
13769
9348
20551
17177
7211
13227
11240
13636
9037
14665
7290
14133
8031
19304
15168
4226
7574
10577
668
12543
14862
10031
14043
17305
19288
427
17180
19163
3216
11
10829
14050
5730
6326
12203
2014
2997
15271
19424
11794
19987
20530
2331
9130
9474
1248
12587
18652
15838
3847
15453
20338
8782
9249
19546
4481
20266
5066
6261
12548
19801
4185
18688
13750
17439
8197
17030
16718
6448
7654
20856
12428
2054
5332
8192
20070
15772
5611
154
16278
8890
4932
8773
17946
5128
13226
12893
2935
16131
662
20979
5007
14481
12438
20814
10745
6775
9331
10916
17221
13237
12876
966
21159
6708
18856
8573
16708
15937
11119
5053
12575
20043
6009
7122
10611
14202
3027
6704
16603
4833
6954
15340
12550
2242
8368
10327
17397
13369
1115
13548
3177
18161
4563
9846
8647
7659
4963
10218
4587
20898
13074
12710
19383
14565
8220
5475
9509
7961
14679
2415
11622
18702
15764
5675
156
12425
2373
9582
8967
15836
12207
8449
1769
7897
3556
17357
5450
20522
9973
10924
14107
10120
13356
12590
4256
1167
13159
2071
1178
11488
12230
18541
7957
5355
19838
14958
6401
20071
1264
15072
15862
2193
17168
210
3056
14009
6026
19239
14223
7222
12786
19338
5513
15542
6224
21205
7864
11942
16961
6021
8921
7192
15592
17556
16651
8079
9821
1099
14304
4635
470
1101
5531
13698
10554
15771
5046
8365
19380
8136
3969
6302
11708
14315
15910
9286
9234
16634
11540
4764
12987
14105
20415
8726
7798
20439
8016
8260
1782
19809
1127
8895
7453
2770
11742
839
11657
10850
9847
3168
19369
17420
17094
18211
4747
5244
14462
12885
11505
20527
10243
463
5821
20630
10540
16847
1139
19440
15149
4069
8916
10092
19329
10060
2791
16075
19271
11440
7237
14083
8796
7428
19730
18617
14287
16349
6849
19581
7334
14745
19673
5040
12063
6463
18841
3603
8394
7822
14533
10101
1987
16991
20267
11549
5291
16818
9185
20862
17549
11451
2019
15986
6996
8793
15212
16638
16762
12846
8868
12870
4873
17528
12852
12264
14042
2659
12009
14221
2635
18325
9231
3964
3210
5796
4759
14931
14778
21
19260
1261
13424
9780
12038
18392
12440
9731
14459
20878
5137
19404
17588
4196
13498
18012
18299
17214
2824
18563
5078
9085
18491
9749
20700
5449
7804
10059
9018
4611
17252
8005
14244
567
3748
13978
11900
7768
3456
4533
3023
12053
8423
10880
14603
13543
5108
9933
11818
3621
13199
12928
7684
6584
7750
12697
20737
2814
9555
17441
17841
4973
18016
17829
8508
15500
14071
7992
14019
18248
9913
4701
2471
4182
20175
16288
1576
3252
13610
12980
11030
16652
16841
19873
17103
20872
13961
9318
17349
9366
2005
6952
18683
12673
13340
1039
15655
3663
7212
2517
729
7361
13627
9909
1881
20632
5504
16164
17539
13078
14534
12241
4301
17297
4495
5827
18665
529
6873
16398
7591
19605
17986
19916
13285
11309
14356
16547
17
11411
15478
19545
10505
20844
20553
11582
16572
11678
554
8055
11870
2440
14337
10285
2146
20599
10655
18384
6597
2340
9455
9233
16207
2072
9610
13449
5072
1133
12611
19408
15695
9409
20013
14238
10974
13416
12589
20825
9955
10878
624
8121
10897
7106
1868
19604
4121
20109
10245
14756
5719
7035
13367
14316
6011
17817
9216
12105
19555
10129
19766
11127
1648
6418
216
19050
14409
12976
14353
7588
17411
11984
4474
389
2271
18567
4402
1748
14119
13989
7950
21035
5297
14832
12823
3887
17272
657
17130
11263
20512
16324
15311
8925
12514
527
16864
1284
7774
11776
17020
17086
3588
4487
17525
10336
20227
4353
11817
3445
7347
17372
1554
16633
4496
19221
5006
6562
8312
18996
20677
16973
14637
15069
8979
1069
1668
565
1367
17052
3274
7545
6467
4006
17618
16080
3244
20443
9787
12049
4978
4885
3146
17507
19342
18931
5056
12484
2949
16471
6129
14396
2402
19813
12109
3883
15033
10239
4561
2263
16209
15677
677
15308
6817
2457
12169
3498
19722
19932
13859
18995
9202
13030
7238
1733
5376
15474
18108
11458
14329
15482
4209
10776
10592
7184
14788
17889
11326
18583
18839
5631
1903
2852
4329
16679
1661
19151
20732
10495
20894
16095
20306
10819
2134
3958
7181
11573
9789
18733
9497
11339
19519
7777
8655
13119
110
1729
12913
18018
6141
11867
10821
12257
1098
3088
11795
4093
12308
10114
6152
11129
11631
2508
5640
5578
17267
17326
11564
20333
17369
15450
18810
2276
12126
611
12805
21138
9726
11134
18642
1569
13457
6312
8803
12804
7850
4762
15356
16331
17982
18930
11578
16500
19723
5743
6070
17227
10898
606
912
15966
3479
1197
13010
20984
5748
12569
19853
11286
2977
11995
18158
15580
8699
18441
17300
13688
2638
11508
6336
3060
14588
8936
20210
10360
1472
3546
2822
8124
10177
3625
17391
15288
5957
7523
3260
18157
16474
15947
10802
16154
7059
15300
12396
19067
13881
14140
14331
7938
10768
8908
4192
18636
21009
9449
18837
20923
12746
5175
7248
12907
18313
13358
2389
5755
14642
12576
13783
16901
16799
11233
14174
17330
13745
221
16394
15773
6030
6837
16946
14504
11063
17276
16663
17152
13907
18724
18811
4181
11048
10076
4085
13694
16987
3988
19514
2541
2790
5973
585
2910
4445
8263
4312
17917
11543
12596
9928
5786
14977
13210
5783
12265
5013
20907
9174
14188
6679
14681
18892
378
774
17099
15191
2177
9880
4250
1073
2559
11803
2648
5200
20001
20285
11566
2623
9502
330
6540
14636
7819
17592
9132
4126
208
12399
8634
2525
6754
2105
18846
13321
2838
13674
10515
21166
1374
5877
11115
6886
20409
5617
20434
2768
4448
7410
2808
14260
5746
12959
14488
1482
9071
9109
6885
13008
14922
14559
2899
13031
14872
6699
3488
21006
9437
17471
16967
14015
16316
5597
9070
1083
17062
13986
11142
17707
13262
8185
17676
3178
14796
18901
941
12820
337
17336
4512
11541
2195
19551
12405
6313
6059
18850
10111
14054
12450
10038
14904
10313
710
3674
3534
15401
8649
8073
18479
6049
137
12860
7808
1975
20482
18611
9670
5966
5154
14733
16375
19851
4464
3256
1691
758
20554
4451
2894
6283
12610
1749
3113
7617
12219
20481
19675
6020
2848
13295
10668
1441
6002
4021
18300
5997
12660
6073
14279
20771
15238
18595
12371
2501
6949
5700
2890
4636
19031
10335
2861
496
16754
1718
7105
13876
4218
9379
17073
15306
10290
19395
6980
19482
426
20154
9169
9411
11814
1096
11442
13862
6778
19554
2221
13908
11868
20158
15982
5913
5608
4440
8063
11253
5033
15262
18673
15237
2159
3057
16509
6253
21103
14222
4933
3206
13484
10373
3087
1994
15210
14520
8677
20730
18506
5975
3967
7549
5689
9108
1596
8965
7582
14978
13917
12132
854
5828
34
10194
9120
3048
9082
9099
13222
12414
6502
14591
3378
4071
4020
17964
3583
1222
90
17990
13536
10884
15138
168
7889
421
9942
2169
14722
11302
1468
1730
4911
9735
9154
12946
12828
18951
7626
6004
3954
14574
19447
16456
904
9057
12546
6604
1431
12741
7341
19591
11691
13598
12081
120
7069
2025
12992
18342
19084
6275
9115
4768
3229
18003
18324
5239
17465
12930
18793
15987
17127
4733
16447
12802
11224
17382
17404
19670
10053
807
19786
14647
849
15466
3468
7904
20641
10754
17069
4811
14998
14297
14964
17170
5335
10769
4125
16869
2581
2354
12050
19425
14709
1825
437
10431
12524
7742
1047
20107
13873
7176
16783
836
2115
12726
6633
8492
328
18609
11072
1009
19577
15633
16538
1146
7134
8474
2892
21028
16121
15084
3772
2142
9482
3388
21123
13370
16567
10085
6559
12982
18081
3400
20458
1424
3671
3374
20621
7531
14956
4194
14177
1660
4639
19083
5087
17443
8613
5639
3665
3822
19999
19001
5536
9806
5150
14184
8686
1873
2857
2843
8500
16563
13396
18103
1958
7010
19427
17615
15215
14479
6438
18596
12162
4958
9210
9064
20186
10757
18382
18717
13956
11740
12389
4382
5123
13052
6881
2181
11167
15817
6685
10649
20132
12536
652
954
16735
3850
8390
16832
13529
8678
3623
17229
10862
5472
19272
3660
10659
69
11807
707
15746
13190
6223
5867
10485
18484
15903
19419
9445
16333
16976
2250
5681
13388
10571
2942
7140
14492
10164
1973
7981
17826
15572
21182
1480
1752
16495
546
17002
6654
18341
14228
7567
8331
18938
2957
2972
6167
10625
19693
20097
7770
12665
7457
18507
49
13931
3383
10691
6190
7340
20637
10468
7517
12149
2716
20570
18219
14345
10498
15519
19832
7816
1479
9702
5460
7049
13339
15568
10301
15276
6471
18767
17751
6063
16564
6339
10406
18227
20287
18682
10999
3533
15997
16311
11720
12202
8272
10440
20020
18344
8543
2208
4570
16516
10232
7764
11165
10130
13611
10998
4319
11076
7403
18523
10147
26
2057
8980
18952
10401
3416
1207
812
1812
16264
19241
16058
19820
10716
4744
8066
20555
17342
20384
12776
5831
6288
16497
7155
7236
11550
9881
13810
10995
234
13622
13257
16329
18781
2947
8990
3225
18376
4168
14441
15599
8339
9416
12422
21018
19535
11706
2860
15530
16330
2532
5117
981
1190
17553
5
3937
3365
18051
6658
7827
3430
9492
3611
12724
17797
8995
7083
17836
7755
1023
17187
18216
9948
6060
8537
10398
3333
17646
16616
20996
3643
19229
10108
4212
16044
14727
4391
957
7045
10905
4072
5554
17023
7345
2481
13240
14077
16274
9528
14750
20250
8212
13604
15321
3117
4287
10589
6585
13772
1331
20840
12364
3539
6422
13093
15660
7387
20497
13926
18354
13296
4206
16287
5680
16728
16540
20104
9291
16713
8015
3338
17388
10439
6720
16460
13692
2452
4271
1957
19214
11729
11232
12909
4549
17975
19481
10605
11306
18638
4596
7533
21132
3307
5763
11617
13034
11230
4692
5331
14943
13276
4220
13816
18780
13845
12829
17559
12965
11725
7415
12664
5510
4110
18004
12122
5257
16506
7719
3683
19574
11485
5509
1559
6155
9614
9302
6168
17368
15328
18580
10755
8454
9167
15480
14277
1001
1643
18358
16205
16442
18649
17077
9541
7685
13256
15851
18281
19110
13955
6637
7947
2291
16436
2267
4897
6081
7476
14197
10806
19121
20291
18994
14059
20055
14923
3121
16648
3493
11956
7881
5421
9781
9
14819
18409
9618
2877
238
10632
12750
19954
8850
12401
17106
11430
10444
4913
10734
20148
3149
3682
18503
7384
8090
2524
17258
16061
5321
7613
615
18235
9981
10235
19575
12473
5003
21210
18114
14150
15235
18485
11521
12054
20237
9190
7945
17398
17538
18092
14418
19747
16667
12816
9724
18437
3574
20610
20583
8845
329
18483
2412
20776
17779
15594
6018
2573
11374
11570
13103
19258
5898
13833
4482
18579
14474
5925
13847
2794
2162
11903
1454
19095
1328
2920
11689
18361
13364
6287
8336
6409
13616
1581
18890
13586
20924
6179
18321
7907
2971
15277
13317
13118
12717
562
2844
12701
17093
7762
17059
18238
13248
19587
14774
20568
6205
1316
10077
5996
8455
11170
16092
14596
6531
12091
5245
11189
4494
14854
15307
188
3497
4606
17151
19631
1152
16214
2698
1851
5875
11829
3102
20744
12300
9762
976
416
10074
20686
20286
15673
7283
9287
21026
2594
10813
5086
8733
16996
18231
1401
11483
15801
8779
16690
19111
7301
588
8861
5105
3285
8280
1928
11665
7050
11556
9602
11203
14537
16860
6242
4266
20557
18293
18660
18093
6616
10214
5744
2502
6067
10306
17521
10178
279
359
9971
8291
9595
4948
5776
8664
15467
5832
8461
3073
20253
20884
11983
16399
17458
15044
5567
7817
14256
6173
19462
4827
7604
20949
18677
12133
8628
13857
4695
12417
11180
15160
14966
7577
6598
18037
12915
20505
8529
4866
15900
18404
3314
1155
10244
14103
10867
8817
4338
7052
975
4633
1143
14206
19036
20816
17060
5705
9747
2357
12412
9598
12949
19146
3799
12648
15260
4344
15038
14771
13192
9346
10899
9918
7564
4900
21145
3774
9039
20836
2428
17603
2951
16040
9259
14252
20177
18884
12020
16647
14156
15974
14544
18782
386
656
8704
11546
3803
19265
8069
1299
18076
12387
12315
19029
7743
4328
20209
12354
11972
15587
5109
11004
3156
16343
10073
17456
6948
4776
4736
15893
21181
10601
797
18497
6661
4501
20785
7707
5481
6695
14658
17029
12419
5286
11686
6088
13618
14867
16788
6523
5778
571
9593
5738
19948
17366
12447
7089
9241
15875
18098
18369
2753
17018
9400
12062
20095
809
17560
19715
15581
5184
18517
17251
10559
10895
16015
8974
13997
8819
8852
18798
1084
3306
13193
3809
13087
14672
4643
7619
14343
1458
956
15578
6008
19852
11482
10826
3375
3966
6509
9662
6850
16855
11662
17650
18873
14580
881
4568
1740
5847
13196
20587
1160
17853
14429
12624
7716
1476
6716
17419
8615
9510
4184
16354
18045
1734
12957
12208
12826
19112
17531
15925
8551
9952
19177
5204
20383
7499
3343
1453
17067
10208
18233
1100
1974
5290
10229
20646
5752
1389
5059
1817
6031
11169
1089
18928
9968
7205
9978
5293
16684
9977
8621
341
15744
14088
7218
18152
19170
1553
17393
13167
16552
10255
19563
18052
14670
95
8022
3765
921
14012
18804
19592
18099
7769
8412
17389
14096
17273
16272
13968
16157
17384
2893
15495
17481
17764
9874
2070
17335
7291
16840
15723
6986
8622
9494
19618
7265
18203
14028
18348
19426
3976
20702
10063
17737
17316
13921
1456
2422
14168
7618
3355
10271
17396
15853
18176
11750
8427
2925
9423
18426
17726
3763
18118
7797
20532
4801
15270
1919
11722
3280
10348
5219
18258
20739
12351
17198
6240
246
9570
14359
20793
19393
3647
10521
6670
10464
9994
8381
3738
12613
20045
2118
4929
2767
1433
5711
17485
12497
13013
13595
3047
14914
1201
9573
17749
7024
13880
897
4105
6368
512
3777
11487
19997
17438
3417
20951
19390
16305
16534
8328
19923
13747
9005
19352
10914
17470
20327
20784
18082
6919
2556
14205
1418
15252
9687
14602
6247
3632
15197
17887
14342
2218
5317
17895
18776
14431
8400
20543
15005
20068
7959
8955
16877
10166
1792
10171
20493
19584
15566
2509
2496
8437
5816
12235
2176
1601
17157
5527
16002
11823
21196
11336
17451
20625
20222
9764
15029
19952
6279
16059
20170
8894
6466
8642
8155
10758
1106
14483
19757
15131
14823
2681
6683
8152
10221
14047
14800
969
2475
19012
8210
16905
11624
7796
19630
4269
16132
2326
1966
16733
7951
15880
13771
21104
18040
10922
5319
6198
10308
15831
16853
650
15742
10533
15878
9720
19181
20944
888
15059
1455
5466
1678
20812
19689
20807
2905
18402
16696
9571
1260
20881
18792
233
670
4097
766
20073
12462
18729
1428
12655
1258
14069
3895
4872
10258
453
13447
14586
12903
19785
20900
16170
9944
16556
12294
11364
19176
11844
11545
2793
1410
5645
19834
8488
5000
4119
11278
12788
167
5039
3528
198
9076
17044
6037
3601
3779
20361
17635
8576
1353
3094
12504
4822
12139
12948
713
7505
7609
18626
18205
6825
16202
19354
19936
8958
15187
17736
18050
8242
10158
15053
15938
3859
1967
20105
16182
6643
7655
11626
12288
641
2470
10004
9786
6381
20134
10230
2037
11731
16505
16141
490
17218
7266
19769
8392
3045
3211
17891
12540
2680
7931
18912
18262
18749
5938
14138
13501
6043
3435
10503
8044
11976
9545
952
3473
7229
11107
11006
16102
9463
7890
6194
5011
1760
12706
17434
19562
11871
17960
11918
17257
10089
17340
6148
2699
14190
5223
19756
12489
5397
8219
4356
3711
12766
14993
13624
11011
13045
13838
11752
18718
5478
15387
8043
12527
16938
3995
18833
1778
6354
17768
16851
8913
20436
9905
21189
21008
20293
20147
14363
939
6812
20861
1403
1846
8684
15860
12585
14855
16982
13573
17532
405
16198
17101
14246
6282
17870
9058
16792
19140
3131
5060
7870
11049
7840
20094
446
7866
7563
13565
18089
16582
7395
12935
18823
4956
5948
7034
5398
11429
5437
18755
8513
2425
17957
15584
14597
18680
19492
11481
4022
17244
6859
14350
2619
9710
15787
21051
20748
6455
804
419
9131
13177
313
13569
15231
20196
16873
10933
6671
21062
7663
17132
16700
2086
9370
18730
5512
10417
20986
4670
15806
9896
16699
6356
17546
6577
10973
19569
8987
7385
17146
7698
4647
11070
3584
11882
5480
8486
5212
9759
7795
20272
2297
15970
2733
4410
16781
19196
9264
15854
12554
3642
6162
16962
1892
16826
10591
17126
3502
5106
9609
16086
19493
19022
6887
14866
17962
10985
5026
13843
17351
9592
3453
382
14158
17682
14373
17163
12663
2564
17367
10350
16162
9087
14764
4964
18862
4743
7784
2049
7760
19863
11446
14928
17582
7101
11159
20833
20299
11249
8329
17746
14715
4038
8876
6297
11682
5312
2547
20054
19262
623
10028
19113
11939
15111
147
4803
6306
17128
9122
5704
12793
411
16476
1270
17519
8255
11741
16228
7503
4795
19063
4
6213
13171
7143
5132
4669
10853
19148
388
8306
8018
13535
17460
20157
17129
17813
8288
13731
16671
14011
16430
15943
15809
7167
14248
3202
7324
20563
1791
20755
14721
13740
5779
15216
7452
10088
8646
12127
9868
9052
10456
17723
2617
7193
19
2213
11108
7966
13601
2199
7370
3309
16985
11003
3644
910
4729
8698
1467
12249
13061
1234
9022
15707
7828
18527
20400
1066
10314
20234
6504
19077
17708
11579
6581
10238
20709
7657
17022
13397
15866
2858
11902
9961
2463
3061
11102
14794
17719
5068
2626
6926
16256
16937
20322
1681
5753
20544
12463
6134
6386
20155
17256
5306
14375
7305
8770
1341
7826
8281
19595
5772
6773
16749
6621
16017
19277
3012
6402
13709
7163
3778
6380
18162
20626
17706
14380
17572
294
4200
18444
15999
11197
9540
11597
17828
13612
19692
9775
4303
18913
2130
11418
4288
16475
15183
7231
5648
2124
1877
17827
19672
10960
9347
14572
5357
8393
6207
11677
10844
8372
17189
2189
15449
20526
550
10370
13663
16356
16481
6410
10788
7005
6353
5795
20011
11836
11512
18478
10368
17176
7575
10383
13089
418
3512
17364
19020
4227
19953
11104
14659
19290
11248
8432
13597
4819
12448
9946
20875
16124
20006
3465
18694
9742
8190
8184
12901
8233
2754
14455
16461
13923
19132
2707
7918
13973
10409
20003
18017
10573
16672
15097
9583
9237
7894
11164
14990
19642
4742
534
18243
6135
17918
9110
3626
1847
7721
16367
19547
9192
12725
20883
21024
94
5063
15652
12247
14289
19274
9004
17524
8038
3292
8430
19538
4580
14180
6033
407
5556
2801
6340
145
404
6904
10165
19724
3532
10815
761
10460
4746
17302
7522
10196
8428
16971
16600
8268
19401
5477
15448
16659
19691
13131
20231
20640
5808
10247
5533
19877
9484
19664
21155
17348
11332
6808
6001
38
11190
9689
4540
15837
8343
19624
18831
1523
14932
2387
8227
3942
1562
18771
13435
17976
13896
5884
8441
17197
10066
7107
12136
15550
800
17850
8934
2627
12685
6119
8598
2735
9653
8746
19135
19023
11790
15203
1262
20456
16673
13197
7540
6025
15558
20317
1452
21215
19478
17097
20926
17904
1814
2953
17095
13581
18025
1775
5054
11627
5515
1173
11272
15301
3434
21058
7144
20169
3585
10552
11960
14346
11463
7133
17208
19993
18740
16166
20212
10519
17728
2761
18232
18684
291
3184
338
8283
18172
20713
14112
11637
5980
15115
16283
3330
16189
8903
20678
13830
20461
2492
391
21085
11955
2046
17283
6038
11209
81
14734
17865
15400
8827
6472
2253
20948
2734
5061
1372
10340
12711
14616
6473
7216
15465
17906
593
5495
13014
353
14718
17863
18986
3483
6718
4949
15441
798
19496
4203
1004
13580
14930
19066
11228
4530
1123
13820
669
6458
15796
7818
2670
20879
14980
9096
21198
1183
8600
17900
18820
19753
5269
13133
17179
17820
17972
20228
12386
19861
1764
10940
3639
2600
17181
19458
13781
4023
20786
10877
6768
20909
18224
14204
2646
14348
14757
817
8246
5208
14917
16715
12803
19061
18280
11008
16185
15724
20507
10197
5845
1538
14187
18315
1645
17951
10408
13092
3163
13993
16072
14236
2336
5202
3931
4217
11552
16800
1981
19887
10795
2000
625
6322
8870
18696
18945
12457
3062
3676
11292
3569
10169
9385
6323
11544
16643
7353
14361
21097
7209
17581
18536
16573
14139
17679
1276
13407
21164
8691
19713
7856
12217
7672
2631
15533
8161
9017
9265
8750
4600
4685
2695
18538
12720
12423
258
732
13868
17452
16320
19610
7111
540
11466
5853
7809
4170
20981
9420
14630
1245
6517
16884
19101
17543
20714
8760
201
6852
18962
10242
8998
5895
12480
20562
1203
2764
13300
4375
20139
15001
10558
834
13566
10542
260
18569
16610
17032
693
1950
336
9378
18482
9152
1330
14411
13583
6724
10629
2930
6557
3361
17408
10900
6389
8182
18675
13250
12598
1070
17734
18975
20491
4070
17541
6285
9887
20821
4144
9232
12740
11492
17188
10150
12670
13898
2320
7060
10052
1265
10798
4642
20668
224
19363
2123
12114
16520
20351
19912
2212
13767
3849
9709
12522
13626
5288
15800
5058
14239
3860
14086
14941
18632
10201
17819
765
12343
15013
20347
17195
11042
19864
7991
764
4098
4614
12636
18266
6183
10441
11291
21136
5102
15155
12075
20401
4330
8786
4513
4915
2643
8389
10536
20321
8310
19449
18948
10941
8930
7920
6553
9407
16306
8364
20224
12098
8388
15166
6628
3903
20247
6392
346
5250
1806
751
3485
11313
16090
7429
17661
4658
9816
18633
11886
11954
9866
7021
12899
20592
2386
10117
19236
3490
10556
1326
10684
11297
12970
15267
16052
1529
19126
5233
56
5516
20849
7046
11834
5519
19744
19080
19542
5345
6897
2924
17407
7044
19191
6158
7402
17788
11073
7560
10614
16257
3929
7510
654
1940
7968
3768
3198
319
17134
15445
9960
10896
9835
17702
1800
18597
18163
5157
2215
18610
586
17971
5609
17810
11895
10033
5907
19283
11022
16238
20830
1757
18662
11913
9372
20385
5394
3448
14859
15803
5654
2615
8665
2319
9691
7328
1841
9319
6743
9811
3999
19549
6737
15458
12256
8395
1882
18095
21100
17893
20743
1854
16135
21133
10598
12068
8616
16101
14747
7999
9060
4838
2545
18816
3384
15788
533
7590
10966
18240
2782
10863
7535
8259
20851
3287
15261
10524
16583
12644
4524
12986
252
7091
15240
8235
20281
4676
15911
14040
20954
4666
3940
19443
7022
13441
2346
3884
51
3311
5483
6106
15293
7782
3889
9785
18521
9111
20065
11448
2091
6048
5587
14282
18451
13126
1217
11963
901
1715
4847
15567
172
21188
801
2853
13625
16267
1526
10805
4199
10692
18373
1016
7695
1507
7438
17154
2864
10069
3899
4229
5008
18922
16054
11602
20761
21151
373
10492
1926
1291
13974
14543
2907
6910
19543
4102
8127
4672
236
17633
5448
9548
17835
14276
5852
1186
12778
8997
10110
14587
1750
3566
9659
7661
17159
13112
4962
5714
6766
6872
16806
4207
4905
2133
5442
12449
18968
9736
6644
15420
13372
17085
3303
10180
8484
20305
9763
13032
10662
21135
10017
16190
1848
10656
20031
568
3254
8293
16099
8843
7740
1488
18311
18768
16605
7282
14837
8042
6450
9805
8077
5593
13026
17475
17136
5765
16766
3637
9073
2194
8013
3071
2308
6943
9383
2771
1597
11932
18499
3266
5166
15985
15442
15438
372
19720
2312
18288
10342
19827
16078
1461
15669
14453
10858
18181
239
12669
1029
20389
8518
4276
17304
21195
17274
13579
15414
7694
16031
3609
7006
17838
5916
6442
12503
21191
3107
15555
186
2214
17263
20119
20249
1079
872
15990
19314
9339
20631
5064
12822
6710
9182
8140
12322
3715
2587
2314
16739
11254
3529
10593
11039
11009
2090
19870
2550
1912
16578
12848
2962
20335
6420
3885
3753
1953
12704
3924
9261
16780
10288
9149
12334
9495
13632
14888
12562
6570
5047
12798
3310
16694
8848
19115
13523
20960
11133
18387
11576
13653
16208
20906
16014
2998
14652
13716
18914
7666
17028
325
6112
21013
18062
11349
5952
340
9419
1786
16941
20808
18021
4142
270
12340
5077
17811
1017
1394
18253
6061
347
778
9861
13797
15461
21148
16611
17295
6489
21099
1267
15939
5781
8818
15718
17184
11077
18178
13549
18961
8688
3855
7333
11474
241
203
16828
5113
11801
16899
3996
8584
3169
17607
17806
20135
7978
10249
20487
6435
2228
19003
10931
8515
13072
9843
2688
16842
2353
16986
19106
17266
4160
10760
16668
4123
7912
1625
18813
1574
9940
4857
10034
13450
12525
772
4294
19209
15426
6214
2567
6457
14768
4384
8705
5940
479
16960
10403
13915
14654
1037
20339
15995
17878
1910
19152
14070
1406
13607
655
12591
20738
9499
4710
12843
5723
4717
14726
5151
13562
18421
19071
20303
14879
15626
11944
20897
12632
16153
11565
14338
1071
13331
4773
3511
18705
1557
17350
19621
8669
13432
7380
18880
10357
17444
8550
3800
15381
1206
15767
4528
1836
17035
4998
9739
14068
15198
8384
18967
5468
13977
10303
4737
19463
4115
16175
15783
8026
20797
12956
12344
11235
3496
5582
14425
20773
9333
903
2590
8520
8910
5411
15083
1589
16096
11571
14889
12758
2088
5544
11699
16464
6491
14406
17400
3944
17333
5893
3127
18228
1517
4163
2993
18772
20002
14357
6974
8477
589
19019
14547
7136
20590
19907
20140
15374
6714
20202
13987
5658
21023
5171
11899
19926
1466
8012
19743
11293
15534
12605
622
12753
753
1772
2344
13313
16374
19461
20994
1894
3618
5228
14162
6883
6998
18333
15886
13552
36
19885
6823
20811
20260
5165
18269
16051
2478
5292
757
225
5264
12459
10870
12187
10140
54
3261
18031
15826
19808
3024
14974
5110
17969
3908
4947
8028
18805
13005
10332
254
18641
12391
4584
3042
10142
16794
17941
19942
4033
8313
13592
2155
17509
14609
16698
10920
11920
7204
18602
7970
2013
4769
6529
15802
13476
10653
8337
17586
15950
8499
1706
4485
1136
7214
16380
16695
14114
8982
14229
12455
4148
18666
645
5361
10174
7048
10380
11343
8020
15165
298
12156
5529
18459
14491
7948
16773
5180
15643
1756
7042
11226
4340
19465
3150
13526
16222
6913
9853
15574
15972
15056
3035
18866
13912
17314
3429
12147
9932
7367
20735
6338
15133
37
2774
13970
14550
18917
6299
13287
14048
4370
16155
12732
11763
18648
4699
2738
13308
3208
7117
20531
11126
5010
16994
3836
6437
12460
12917
10665
8869
905
1117
11524
2036
8792
10549
11809
17984
7173
3610
17380
19220
18703
7526
19233
15116
2288
3851
21163
4618
20665
19193
13448
11211
6149
11671
5646
1021
3282
4059
13368
12240
6567
21029
7178
19254
5347
5563
18086
20016
19565
8640
17210
20450
19886
19044
10341
12209
9496
1125
20901
4981
16609
2050
18695
20414
11041
8228
9776
1298
9862
3467
14275
12694
2990
11743
1164
13495
583
7366
217
14387
4712
4325
17886
19396
5415
12721
14303
9043
9704
15497
20982
3200
14262
3058
21126
15265
17533
9778
5775
4117
15214
4477
7057
12859
376
1532
14051
11907
13829
11608
11231
19622
18064
4316
20767
16725
6047
11747
12922
14278
5381
4720
17313
15110
3362
13793
14263
461
11222
13271
8408
4610
1082
9997
12839
11404
8108
18223
9870
16502
10070
17087
1359
14532
10349
5638
8201
4508
3722
11325
10451
16085
14949
13362
10725
10841
9068
14610
334
7164
9212
2983
3873
18367
3677
12890
13696
5417
4628
19378
14468
5636
15586
11894
17994
3932
21098
13274
18144
8169
2089
10484
8439
14284
8404
13648
11370
8345
289
4000
16308
18112
3579
19714
16270
12488
3253
19603
20669
12561
3326
950
8620
20575
18173
13071
20121
8825
5707
8070
20848
2500
17413
3920
726
321
10374
630
441
5485
15617
15730
14044
13170
1582
8375
19742
10907
7376
776
18668
20394
17009
9329
13762
938
7781
21128
15194
8557
1900
13678
18352
11486
18135
9637
17034
6580
13798
3602
9051
18010
14514
11140
5559
11599
10986
19319
3771
1573
17727
5573
20925
13275
14972
14880
5822
14000
15061
12205
10979
4401
9321
16935
16546
17742
6459
14389
5174
19643
15940
10161
12014
97
5502
10091
19849
5622
972
5651
9539
2884
499
1145
10139
18185
19718
20597
19259
2922
2079
7846
8217
19793
10942
9525
15045
2867
9657
13941
14029
7011
8256
17138
19536
5379
4967
20579
18882
4576
17005
12088
846
8045
12594
12736
2461
4407
19204
14830
8993
9151
9197
10775
10824
12119
14232
6962
11199
20802
18699
10359
15259
18464
10851
9543
933
7477
1140
15865
20381
7127
5427
506
4412
4219
20096
10363
3875
7008
2709
17296
15324
9622
16177
19057
13732
20809
20455
8865
14026
14365
18393
7536
12772
7543
4564
1273
17628
1525
6027
4476
1419
3813
14631
15109
10411
16024
1460
10223
15144
4979
1290
6530
14076
891
17958
16915
7090
18756
12573
19552
11799
10537
14281
20310
20775
2959
10578
19660
20917
21107
17634
7175
14267
16084
13149
11074
14153
13318
14217
20696
17977
20711
2002
375
7757
1498
15406
20722
6454
11112
549
10838
12080
9813
16774
1565
6181
20182
10685
9279
15779
727
1618
11354
19358
11821
19487
8122
1465
3420
5551
6024
4990
1962
7923
18035
1371
20332
13268
11595
7103
15811
685
3245
6855
267
2329
403
4466
8663
8157
16147
1746
4794
18339
1061
9807
2383
6549
16252
1281
16772
21078
16418
497
19227
5028
12600
19507
5810
11754
11572
20510
14687
19712
9712
8112
17630
16179
5031
12360
9361
6742
17694
5494
14369
19302
15009
1560
12703
85
8905
2334
18918
17852
19451
16630
1642
10580
18827
19989
20539
19256
11910
8422
20447
2358
17789
11182
7110
19303
8778
4387
17919
8501
4534
2529
7494
18897
15719
13269
7919
6274
11219
14632
4074
1026
12269
19529
20887
17654
8562
18989
18399
5191
2068
3804
9442
11810
9779
20548
1547
5445
16646
20395
15193
4522
6468
10790
10192
16686
4489
11639
18764
6635
3219
15071
17406
7261
3296
3345
16557
17324
10148
13953
598
7200
9429
1598
1108
6546
2589
18195
12321
20585
7067
9063
12436
8813
13557
8091
6364
1300
20110
11214
8019
20857
14905
4189
19127
9677
2029
10098
14258
21005
9590
14959
10670
15663
19364
4106
10800
11994
6151
20380
20165
9296
2691
10789
18942
15128
18787
595
16144
19074
8703
2468
15846
16473
4087
15402
248
10415
8154
17480
2183
16918
2941
8414
5172
8085
13371
4337
15322
16979
18559
12747
8101
11518
19203
9277
15285
19774
3051
13242
6847
10730
2795
11786
4130
8832
781
16719
5024
9910
15090
15417
19158
2854
3725
18480
1065
13910
9603
10703
6307
20620
11605
2420
20284
175
17610
8366
11338
5462
1572
1451
2010
700
17010
2513
18760
7936
4264
20886
14962
18585
21178
76
11098
3349
12807
16507
14655
2486
10962
10534
15020
14953
856
5194
818
16439
17025
10191
4703
13107
19273
413
1209
4490
7299
10020
3258
5961
13589
6372
16408
5390
13577
9958
6918
1168
6753
3503
5747
6292
1883
3093
17907
18015
6264
7441
3933
6736
13134
6172
1862
17262
12518
12273
4514
8693
19701
20233
17739
2702
18502
177
8795
6792
5790
7401
3075
14707
20052
9491
13445
11217
11252
80
8409
10694
11651
16133
6015
7712
13761
19175
9705
11804
12478
6358
13130
6569
7696
5454
16729
18657
7507
814
10647
15008
2588
10365
17098
12333
8539
20591
18615
387
3153
14247
15345
2095
978
8949
5863
6836
324
14074
16562
12008
1823
7829
19047
20173
16262
4705
20606
9728
4452
19906
19285
748
10929
6703
1049
1360
17617
13852
7942
242
10086
13718
89
9118
237
11123
20503
7202
1350
7706
18085
17908
16470
10154
11831
8354
4405
12699
13712
14585
2690
3499
6997
1132
19317
14848
15901
13516
13418
1767
15915
7132
1897
14549
18826
14713
9363
11951
10762
21183
3550
516
9633
10304
18670
5541
6620
639
8718
18368
537
4473
4156
3640
58
9307
21065
907
15897
2719
16580
5265
6447
11909
11015
66
12639
12036
11985
3936
11969
16607
19173
18557
1707
14833
11925
19516
17794
4283
20860
11273
20431
18405
943
8629
10275
12666
13846
15928
9939
19950
19389
18577
4983
12951
15703
18170
19118
2310
14309
4041
4657
8447
3679
19253
12016
7278
14635
7433
5984
8054
16042
2038
7159
11381
4479
14982
21003
1020
19947
7933
9394
6174
7994
7547
11721
6992
2430
8802
5862
779
19267
5564
13220
11896
3935
3472
1177
15922
9804
130
628
8039
1059
19579
229
18177
4253
10391
52
7243
6007
29
10289
20238
5708
19251
16585
4376
2446
11958
16063
8737
1687
12770
8682
14254
7585
12905
18410
5177
1879
15895
15151
13571
4204
13715
15920
16804
17580
10874
15289
14803
5490
1034
6225
19869
11869
3961
18828
17750
11698
2512
10299
17516
12886
911
135
20934
11898
9684
15034
9003
17849
19943
12877
16793
12092
14940
12806
20444
8183
12108
19407
15375
16835
2394
9252
17745
10682
259
20858
16635
13924
8483
14634
2743
5830
1835
16623
7979
5864
2879
20595
6942
4498
12381
19467
11010
6355
11093
2674
2416
7751
14457
6588
12116
20588
11423
8213
2055
6062
619
20614
17442
422
19068
10000
8202
14860
14016
21066
5949
15199
2328
17392
6328
11774
21175
3658
15073
72
15443
11147
11455
17409
7749
6676
6235
1624
157
1983
7686
10075
18197
1555
18540
5432
15098
15048
13766
3104
18987
14079
5263
1347
1269
18562
11940
75
9246
16626
11151
12607
11873
4008
11516
16581
16827
7539
1595
8603
9435
1893
4053
9756
6831
104
11479
12519
9748
16433
13163
19867
2763
12541
5523
877
780
15868
5303
1430
19460
12493
826
9636
5206
1960
10206
14261
15785
5188
12668
3419
9560
4111
3962
10535
163
7356
18553
12862
19117
14968
17624
4562
1368
7583
14493
5741
7407
2715
6642
18712
13677
8983
11168
13687
100
15052
214
20866
4532
17683
18222
4708
19197
1629
20410
14498
20103
10072
15916
14604
19238
3407
17926
2722
7858
14555
9389
3801
16134
4263
20679
10445
2411
4461
11218
15608
14160
12690
7313
18881
19816
16730
19054
12927
6245
19726
19321
17884
17224
11160
3997
9699
15046
16955
4322
15654
3688
18889
17597
4968
18861
2198
19998
10793
3004
9239
13264
1263
8444
2203
13468
2604
5941
17996
11346
19678
13187
9505
974
4046
3001
9783
2053
5650
11456
13470
15888
20307
7263
2347
3055
7518
13944
13850
2516
18838
11148
17209
2052
3112
501
486
17721
10376
4030
19459
6006
676
13932
7552
3727
1551
5441
9186
13992
30
13069
1121
20254
3786
14461
5012
11620
14478
20749
398
20350
2144
16763
18900
1165
10660
5387
4214
13700
1038
10718
18584
20459
12331
15142
19213
19646
18487
15577
2330
9036
9137
11630
8853
15641
4526
11874
8098
1087
8119
5686
2729
7041
12857
9006
9972
7934
10889
8724
2769
250
19165
2807
9898
4447
13669
10465
20680
16011
16197
1322
11979
1930
20214
1345
1154
4109
4413
9777
7386
6631
13935
14285
17565
18225
12267
9310
6003
19927
17535
20038
2498
11195
6075
1484
10010
11227
14141
4842
6208
3331
4035
16383
8864
11830
19746
3129
18663
20854
12319
2772
9516
18326
17843
6487
339
18292
15243
8931
3702
618
17987
6741
14402
16969
2756
185
13831
20137
7007
8361
17898
763
20275
11267
20017
5692
9472
14033
2230
3744
14699
1924
20877
12528
13546
8316
16016
12093
6767
12148
12810
4906
13807
12231
16145
18955
19310
8333
11714
10565
7800
10756
19372
7615
15639
13316
204
1218
165
116
20855
7156
13102
11367
17979
18298
11373
8236
11877
19837
10837
16361
17715
8559
4089
8170
14516
731
20403
3459
1970
3068
18230
16107
10324
4986
9667
20160
2749
12743
19513
20241
13400
4208
17200
17327
2979
20334
6972
18528
5942
16950
719
18867
12199
15983
18631
5894
8683
16236
1761
14627
16615
17254
7171
18455
6076
10947
20580
19130
4009
13454
15956
20578
6537
14023
13791
19090
18658
9635
12368
6164
18544
12520
3700
2909
10240
19504
4723
6989
1548
20574
5579
3018
399
10397
14308
12263
4718
14724
1308
16972
8041
2554
19490
20370
13301
14147
5431
2433
15200
17024
705
13903
3981
17700
12507
21171
18322
11065
2116
17717
9569
15981
16362
8105
8761
14185
1536
6265
9758
190
19518
6083
16091
9050
11176
1508
10885
1819
12783
4721
1366
15094
273
14577
14763
11141
7902
11366
7371
18416
16160
1254
5930
9825
8790
7537
12674
15979
10778
12124
6379
8784
15637
3277
10840
7338
9969
13813
21094
2289
13976
18
13288
15674
5870
4849
2107
8768
6639
11628
6521
2620
9069
14613
18171
1003
3181
17437
18926
7988
2493
18414
8592
15148
16654
7519
927
20008
3685
111
16978
8110
9405
8482
14518
11371
11113
16998
19025
19609
3652
3986
9892
16251
4725
20719
10696
8841
11936
7977
519
15861
16420
6760
19076
12085
11175
12188
20644
5329
20295
9810
15962
13425
15366
19976
17464
5273
3119
702
17148
511
9854
1174
1858
10202
14426
5553
785
18383
4277
2727
1033
12707
19843
15689
11337
4216
16801
414
275
7643
11477
20316
9301
4493
18650
4926
452
11611
14573
15229
15179
8297
4152
1616
18164
6497
8315
6510
20144
11137
9313
895
6589
18752
7419
14241
799
18263
20057
13353
4756
7580
10463
18310
13085
5701
19648
17640
17663
12888
20386
3945
14997
6316
6066
7847
17476
12168
8794
3059
18290
8549
13081
14648
17361
5451
17498
20885
19995
7873
9171
19762
20469
8522
17247
19237
5848
10400
17191
18751
17799
2245
12640
2011
13799
7115
6548
5037
17845
15953
16637
14976
1215
16891
15278
1712
13952
17185
10690
16689
16382
6488
10488
19186
143
18589
13465
12943
18979
2381
11923
4520
9530
15508
3513
425
4224
13754
12718
16521
18007
9268
16150
12180
21014
10613
12271
5780
15516
4398
13512
6209
2775
18009
880
18598
327
11110
2960
16865
13872
4154
14744
17017
1470
18105
8498
4158
14683
3387
13278
3617
15593
7432
2369
7898
17161
9788
1184
717
7264
5287
8286
20927
7391
16622
462
7311
2710
6100
3547
20126
3327
10825
13412
12045
12236
16577
10001
7036
16245
1349
8167
4821
15553
4228
9578
10067
7020
15379
13426
1216
18910
12303
2519
16010
15978
5724
19842
11350
14999
7135
13585
934
15410
21046
17334
15570
14021
5018
14578
152
18870
13068
7357
12469
8415
17270
4644
7542
11345
12780
12811
5095
9561
20391
9512
7640
4758
11091
15706
12942
11765
8919
12617
5630
11437
4047
10462
13347
18697
7624
7303
13038
3438
9629
16928
10138
13902
16335
8373
16407
10956
6662
2865
13180
4660
15446
4122
6725
16244
4127
4511
14505
14395
6246
1738
384
3862
20059
5492
4090
24
9927
7037
1677
19727
21061
19652
10687
14421
16535
13421
19945
2453
10427
10362
12808
15207
20133
1352
6369
7244
4113
9917
14714
13900
8436
6565
1097
11062
16469
16143
4602
8424
15635
18403
14628
5181
19846
794
18676
2850
20603
15665
6465
14693
12017
9566
11103
2696
10709
6040
4396
4653
6712
12625
16511
4545
3707
2040
19860
14920
15477
13916
6413
1211
2129
11716
18318
13572
8597
4832
17894
15089
7284
10220
9317
3845
14660
5782
18561
358
8985
19435
14125
4627
4740
15427
10944
19133
13545
6432
9325
19968
19007
13088
12216
8419
4722
19817
2528
6876
12691
601
7971
13458
10200
9889
2583
17147
8290
3443
3620
7490
13502
4064
13891
7119
9986
13413
13386
10293
9059
14929
15469
3888
15564
4889
15456
16920
1321
10438
13009
502
13246
19420
674
11500
10450
14060
13459
2023
2655
8929
18078
20225
15721
19662
3151
4656
20426
15136
21149
15596
3036
16379
16619
15132
18980
17371
16458
1667
11498
18214
18102
9586
14820
263
1494
13238
17063
10467
5644
8196
2718
19432
7955
19157
3007
4804
8617
3226
1959
5149
7199
7232
2058
14900
20751
21120
13384
17631
14266
14919
19814
500
6041
14237
18935
9412
1708
917
4467
2833
8467
11334
3641
6930
3415
3315
19316
20643
5282
8826
5768
35
9549
5210
18212
10857
19506
8062
16965
27
2736
13682
6143
2639
16554
11675
11060
9283
1107
480
19755
18215
13466
5874
17284
2835
7865
12621
15320
19422
2873
6196
14220
21139
10990
9701
5079
19128
17936
8493
19895
13389
12175
4951
12232
14685
21201
4876
3604
6280
21158
9766
10671
257
6506
16227
6738
3100
17795
12171
6295
18686
13146
742
20130
16440
8873
20156
4367
8774
13328
292
19255
15786
1013
19159
4460
9116
12041
20843
1621
2148
18956
18576
12377
10012
13115
13023
13949
16097
4211
7000
5943
10502
688
3197
13460
2307
9367
16255
11398
8806
3353
18094
3235
5336
3891
10366
18605
4042
19075
8696
18791
8156
17577
19362
14769
555
18953
9089
16488
12574
8431
21122
17510
10045
5302
18966
14915
10711
16970
15961
8645
9599
10322
1185
9519
6068
1821
5950
6050
8198
19839
15662
6146
3241
9373
2656
10532
21185
16317
2970
3268
11506
10569
8633
5352
14186
16232
5591
17548
996
5581
2443
19201
18957
1416
15835
13055
19667
20388
13175
6184
15704
149
13406
12638
19499
5903
782
11590
9388
16479
1830
4525
8588
1815
19530
8671
1605
4415
11090
8007
18063
6483
11280
14827
5818
14448
9815
7932
14250
9646
2395
9626
9015
3708
16966
3413
9882
20180
18735
20153
3833
735
8831
7928
19509
11655
17469
15076
16325
9685
3757
13809
20815
13657
2616
6484
11614
3243
4680
4950
552
14984
124
15454
13735
16956
19125
19202
16260
14711
3706
21115
9464
14846
12765
4681
4719
12792
7915
20466
7916
7930
1666
20824
14325
16529
12912
5789
11220
12293
7086
12328
14740
19874
18377
10319
9019
5222
5167
12693
16120
20502
6492
15280
10261
6678
5518
46
12413
14730
3246
14203
859
19967
12705
1377
808
6035
10051
1339
4039
2469
10277
17677
3080
362
142
6216
7259
5052
12194
19073
3205
9035
2117
5284
19242
15640
19174
15631
18627
7608
1927
8143
14393
3599
18239
18166
20781
17373
4101
7116
4363
18374
17877
11547
523
7935
18022
15780
9574
16533
12229
13208
332
18916
8526
12730
4051
2992
215
1579
17901
10511
8996
10222
7364
7852
20863
2961
5205
8350
10424
17672
14085
16284
14127
19139
4468
10002
13452
17770
20337
9877
15918
15678
20518
1982
20319
18027
16892
824
12854
15871
13736
13575
394
16816
10904
4438
6522
180
2113
10612
7690
3043
7228
20449
3344
13996
10903
2364
16757
8080
965
14471
15494
14008
1329
16110
14092
17573
6870
18247
19634
4190
3086
9938
16593
4183
2663
9572
12234
20268
16885
17766
13670
16360
5801
4138
4001
7297
20995
15182
2895
8732
4018
3359
19960
13826
8519
14913
10975
20795
18571
21052
810
16653
6461
5539
16925
20371
249
11196
4273
10126
18287
14245
14494
1949
11525
1904
17652
20049
4274
5029
5276
745
4612
11229
276
20423
19370
12517
1541
13040
15595
3863
712
2278
8176
3223
19010
11403
12352
9498
6133
940
2652
6684
18101
6573
8049
12841
667
17414
7378
21143
9415
13537
12376
3896
16008
4686
12260
8804
16743
4954
5855
17131
10525
4178
9362
20799
12675
13875
6564
2122
8886
316
13866
3505
4823
14716
8947
219
455
16924
1351
15440
20457
7833
13939
4578
10892
1672
18046
13185
3230
17744
2881
2445
18777
11223
9544
19035
21015
19014
5729
13224
19505
21204
469
15150
11560
15173
13320
2351
3994
6332
5988
11207
11470
9072
18274
13560
13609
1399
12490
15349
11408
15213
16303
20911
5365
20602
1109
561
14080
12565
6193
11264
12170
14786
2568
2051
7268
2480
12501
16281
126
14694
9773
10379
4291
12429
20150
9146
15743
9074
6627
2762
5670
13561
5118
10586
16771
15589
15805
18879
633
3735
228
150
6694
5070
15828
4108
15600
12818
12542
8650
4222
11751
3409
8058
11043
10902
18778
20473
1701
16650
6603
6958
20725
13909
5383
13065
8495
15561
6666
13550
15613
9138
12355
4077
2593
2746
10581
17223
18998
9542
548
12052
13478
1793
8082
14372
13024
12931
21141
4806
8697
9894
2280
11758
3270
7063
7598
10839
3170
1376
942
10426
14894
5134
13806
5236
20336
2044
8051
14178
2658
13207
17763
7516
14144
7538
5305
11569
20980
8964
18734
11531
11961
13077
13439
10743
17825
17220
7306
19476
18153
9381
16028
3013
14663
1369
473
11526
14470
11859
16642
16171
20023
15433
10372
12530
19990
8362
12421
17639
3474
4901
21130
21017
14770
11761
14738
20645
2157
213
9914
19600
12709
13290
14344
8568
5756
4946
343
3144
6525
16212
15122
9229
2341
14091
8612
7720
19918
12895
5910
11056
9160
16219
17125
8859
16657
10295
8963
19018
18932
17614
1137
16561
12700
12181
5315
7611
11139
5190
7138
20102
16372
3755
12787
14401
7506
13927
1181
44
8834
1502
13387
13693
12037
20320
6675
3571
144
9639
4024
19940
13044
9219
6305
14666
9790
9617
7772
7108
8666
6782
1634
4372
9707
21081
18174
17790
4045
15714
12761
6263
3782
5921
675
6982
16750
7735
20736
15676
4619
17649
11146
9023
15039
15282
3140
15711
20277
17172
2472
9802
9698
18939
16403
2360
4393
5351
3938
8081
13122
10246
4709
9172
20828
5914
2923
18895
5521
1544
18256
235
1675
11311
8675
17668
17991
12534
17341
13531
7304
6446
743
7783
3853
9450
7064
14617
17711
7130
10526
13431
1196
14030
14320
17824
7572
9356
2535
18113
12372
9077
6651
10309
11318
19807
17462
10673
18661
10917
15847
2836
9794
8810
11638
10307
18217
15350
12453
14556
14538
12572
19231
15365
11391
13905
18853
19092
3011
20183
7636
20720
1550
1129
16838
20280
10731
17885
9478
10097
16068
19155
7674
14881
20324
2484
2223
1951
4084
14704
8397
8977
16736
1852
20939
7172
9965
19235
211
96
20204
5861
14710
18133
10145
19000
17952
4191
1511
17933
8084
11846
5296
10396
2915
10015
7606
16388
16863
19611
6249
9851
13059
1822
12179
21090
10729
20100
12064
10455
11259
13893
8241
10992
15304
18096
9842
20528
5367
7097
2385
11760
20475
14439
10176
4884
64
20217
20136
7710
20600
4243
10970
10630
79
3406
4289
14146
8651
10386
10848
9020
2943
5420
8262
18307
2229
13404
14582
3678
10272
20069
7877
2911
14251
7599
19143
20766
6827
11773
20865
5023
13576
13399
19452
15924
1638
8608
14473
3133
7652
16462
13929
692
2306
6427
16948
5243
12113
9558
9027
5260
8984
19612
8759
20012
515
4818
21190
13685
20845
13383
18537
15112
15359
11462
11822
14388
3698
9554
17120
14645
16512
14857
7012
17089
2832
3697
7445
4280
2173
3649
14891
11966
6520
18340
6267
18623
18068
7607
9493
1896
17422
2869
6608
18825
7623
148
19293
14334
11618
17277
734
20220
1104
9672
8970
8451
15432
4766
18894
13803
12834
7350
8738
3591
4499
14677
8787
17574
18150
10911
19431
5148
15385
11402
17731
16235
15909
3736
12030
14676
5434
15018
8758
333
13721
1138
4620
20791
13168
4159
3672
7190
2906
15257
3152
14135
12146
5235
12868
5377
8791
13634
3040
11548
2976
19340
17065
13309
821
10834
9690
10744
18213
19862
20810
7521
10619
16515
14335
1315
6012
16149
3718
16545
637
3009
11738
2804
8218
3166
11842
7095
11670
16266
4671
18260
9207
20365
16656
16140
18245
14902
12402
5501
12633
5814
9899
3607
17629
4535
15239
2778
4875
14358
19946
20393
3039
8346
19792
8973
16831
4632
15525
2363
10276
1213
11885
20667
14657
9460
1899
13513
10071
4368
12858
12734
20888
16268
9327
20826
1446
2805
11066
8087
15412
4920
20041
7245
4800
7308
17673
5246
17876
17399
4297
13423
18278
14037
980
4010
19349
5342
3234
17858
4333
4914
5918
1435
7165
592
5141
14825
15327
13588
11201
16814
8199
3464
6750
508
7224
5409
17174
12158
17281
4982
10637
2811
20064
1445
9793
18476
20692
7028
7752
7281
14036
18127
19734
7746
16541
10599
10432
21160
8807
16916
11791
18057
12461
4783
326
10633
15969
3207
13189
5849
6689
15234
7055
18023
6090
20873
12039
4048
3486
10399
14653
7455
19091
10481
18370
3596
12065
9873
15447
11581
1781
18664
18710
553
4171
2634
874
16397
1250
146
14608
11389
7718
21152
20993
1968
5709
5234
18327
7922
1440
5823
11289
10566
8083
10499
15700
18199
15727
8822
18520
4272
2012
7246
2252
13324
2630
3138
11652
1253
16393
10168
11537
3780
13202
8177
5750
3233
17658
4593
16478
1679
2460
21037
11733
9255
308
16959
10890
1599
749
3739
918
3781
16940
4583
3520
20124
18601
20710
5871
9791
3790
20538
2664
21082
18958
1362
10531
3648
9047
11904
5546
12272
17410
8142
12580
8092
18117
16747
7914
13567
4244
754
535
6053
3657
6077
7098
5295
8380
18425
15181
13667
6220
9564
1242
11854
4781
132
4313
3754
19455
12298
5995
19920
15378
14700
5922
10032
19345
1705
17050
19145
9386
19284
11116
16908
10635
5281
1032
3890
18466
5279
8174
4234
1091
18603
10856
1818
8892
898
15371
8604
17861
12330
8547
20114
5125
19892
4969
5144
4858
13377
17288
8512
18586
1869
11504
19471
612
1124
3482
19172
12775
16234
11435
14104
21111
14691
3590
3651
13127
19857
19935
9324
17905
19315
19705
14511
4887
17401
1697
2515
15812
20259
18145
3950
19803
9263
17081
12253
607
10514
11943
18988
13853
14797
3552
13899
15164
2020
17508
13174
10777
4541
18965
3971
13768
9700
10590
5726
21112
6907
14490
12988
20301
5679
6315
14381
20063
4381
1380
19185
10054
2889
8207
11298
16574
8978
4626
